erp3l/src/Catalogs/ВидыОпераций/ВидыОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОпераций</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВнеоборотныеАктивы</name>
      <description>Внеоборотные активы</description>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>ВнутригрупповыеОперации</name>
      <description>Внутригрупповые операции</description>
    </items>
    <items>
      <name>Консолидация</name>
      <description>Консолидационные поправки</description>
    </items>
    <items>
      <name>НачислениеОпераций</name>
      <description>Начисление операций</description>
    </items>
    <items>
      <name>ПовторыКорректировок</name>
      <description>Повторы корректировок</description>
    </items>
    <items>
      <name>РегламентныеОперации</name>
      <description>Регламентные операции</description>
    </items>
    <items>
      <name>Резервы</name>
      <description>Резервы</description>
    </items>
    <items>
      <name>ФинансовыеИнструменты</name>
      <description>Финансовые инструменты</description>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>КорректировкаПрибыли</name>
      <description>Корректировка прибыли (AJE)</description>
    </items>
    <items>
      <name>ОперацииДляЦелейОтчетности</name>
      <description>Операции для целей отчетности (признание и сторно)</description>
    </items>
    <items>
      <name>Трансляция</name>
      <description>Трансляция</description>
    </items>
    <items>
      <name>УчетныеОперации</name>
      <description>Учетные операции</description>
    </items>
  </predefined>
</mdclass:Catalog>

erp3l/src/AccumulationRegisters/СтоимостьВНАМСФО/СтоимостьВНАМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтоимостьВНАМСФО</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаВВалютеУчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Переоценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Обесценение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РезервПереоценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПереоценкаАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаПартии</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВНА</name>
    <type>
      <types>DefinedType.ИсточникВНА</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаВНА</name>
    <type>
      <types>CatalogRef.ГруппыВНАМСФО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидУчета</name>
    <type>
      <types>EnumRef.ВидыУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.ВидыОпераций</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

erp3l/src/Documents/ВыбытиеВНАМСФО/ВыбытиеВНАМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыбытиеВНАМСФО</name>
  <registerRecords>InformationRegister.ПараметрыАмортизацииВНАМСФО</registerRecords>
  <registerRecords>AccumulationRegister.РасчетныеДанныеВНА</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьВНАМСФО</registerRecords>
  <registerRecords>AccountingRegister.МСФО</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗаполнения</name>
    <type>
      <types>EnumRef.РежимЗаполненияВидовУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассВНА</name>
    <type>
      <types>EnumRef.КлассыВНА</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВНА</name>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>CatalogRef.ВидыОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>ВНА</name>
      <type>
        <types>DefinedType.ИсточникВНА</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыбытиеСтоимостиМСФО</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыбытиеСтоимостиНСБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетРасходаМСФО</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетРасходаНСБУ</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетРасходаСубконто1МСФО</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетРасходаСубконто1НСБУ</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетРасходаСубконто2МСФО</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетРасходаСубконто2НСБУ</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетРасходаСубконто3МСФО</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетРасходаСубконто3НСБУ</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧастичноеВыбытиеМСФО</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧастичноеВыбытиеНСБУ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СторнироватьДанныеНСБУ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/Catalogs/ВидыОпераций/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьВидыОперацииПовтора() Экспорт

	ОперацииПовтора = Новый Массив;
	
	ОперацииПовтора.Добавить(Справочники.ВидыОпераций.ПовторКорректировокПредыдущихПериодов);
	ОперацииПовтора.Добавить(Справочники.ВидыОпераций.ПовторКорректировокДействиеПовтора);
	ОперацииПовтора.Добавить(Справочники.ВидыОпераций.СторноКорректировокОтчетности);	
	ОперацииПовтора.Добавить(Справочники.ВидыОпераций.ПовторРеклассаСчетовВНА);
	ОперацииПовтора.Добавить(Справочники.ВидыОпераций.ПовторПроводокПоКонсолидационнымПоправкам);
	
	Возврат ОперацииПовтора;
	
КонецФункции

Функция ЯвляетсяОперациейПовтора(ВидОперации) Экспорт

	Возврат ПолучитьВидыОперацииПовтора().Найти(ВидОперации) <> Неопределено;

КонецФункции

#Область ВНА

Функция ПолучитьВидыСобытийВНАПоДокументам() Экспорт

	СобытияДокументов = Новый Структура;
		
	СобытияВНА = Новый Массив;
	СобытияВНА.Добавить(Справочники.ВидыОпераций.ПринятиеКУчетуВНА);
	СобытияДокументов.Вставить("ПоступлениеВНАМСФО", СобытияВНА);
	
	СобытияДокументов.Вставить("ВводВНАВЭксплуатациюМСФО", ПолучитьСобытия_ВводВНАВЭксплуатациюМСФО());
	СобытияДокументов.Вставить("МодернизацияВНАМСФО", ПолучитьСобытия_МодернизацияВНАМСФО());
	
	СобытияВНА = Новый Массив;
	СобытияВНА.Добавить(Справочники.ВидыОпераций.ИзменениеПараметровАмортизации);
	СобытияДокументов.Вставить("ИзменениеПараметровВНАМСФО", СобытияВНА);

	СобытияВНА = Новый Массив;
	СобытияВНА.Добавить(Справочники.ВидыОпераций.СторноАмортизацииНСБУ);
	СобытияДокументов.Вставить("ПризнаниеРасходовПоАмортизацииНСБУ", СобытияВНА);	
	
	СобытияДокументов.Вставить("ВыбытиеВНАМСФО", ПолучитьСобытия_ВыбытиеВНАМСФО());
	
	СобытияДокументов.Вставить("ПереоценкаВНАМСФО", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.ВидыОпераций.ПереоценкаВНА));
	
	Возврат СобытияДокументов;

КонецФункции

Функция ПолучитьСобытия_ВводВНАВЭксплуатациюМСФО() Экспорт
	 	
	СобытияВНА = Новый Массив;
	СобытияВНА.Добавить(Справочники.ВидыОпераций.ВводВЭксплуатацию);
	
	Возврат СобытияВНА;
	
КонецФункции

Функция ПолучитьСобытия_МодернизацияВНАМСФО() Экспорт

	СобытияВНА = Новый Массив;
	СобытияВНА.Добавить(Справочники.ВидыОпераций.МодернизацияВНА);
	
	Возврат СобытияВНА;

КонецФункции

Функция ПолучитьСобытия_ВыбытиеВНАМСФО() Экспорт

	СобытияВНА = Новый Массив;
	СобытияВНА.Добавить(Справочники.ВидыОпераций.ПередачаВНА);
	СобытияВНА.Добавить(Справочники.ВидыОпераций.ВыбытиеВНА);
	СобытияВНА.Добавить(Справочники.ВидыОпераций.СписаниеВНА);

	Возврат СобытияВНА;

КонецФункции

#КонецОбласти

#Область Обновление

Процедура ОбновитьВНА() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВводСобытийВНАМСФОВНА.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВводСобытийВНАМСФО.ВНА КАК ВводСобытийВНАМСФОВНА
	|ГДЕ
	|	ВводСобытийВНАМСФОВНА.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВводСобытийВНАМСФОВНА.Ссылка
	|ИЗ
	|	Документ.ВводСведенийВНАМСФО.ВНА КАК ВводСобытийВНАМСФОВНА
	|ГДЕ
	|	ВводСобытийВНАМСФОВНА.ВидОперацииВыбытия = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВводСобытийВНАМСФОВНА.Ссылка
	|ИЗ
	|	Документ.ВыбытиеВНАМСФО.ВНА КАК ВводСобытийВНАМСФОВНА
	|ГДЕ
	|	ВводСобытийВНАМСФОВНА.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ПустаяСсылка)");
	
	Правила = Новый Структура;
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Для каждого СтрокаТаб Из ДокументОбъект.ВНА Цикл
			
			Если (ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.ВводСобытийВНАМСФО"))
				И СтрокаТаб.ВидОперации.Пустая() Тогда
				
				СтрокаТаб.ВидОперации = ПолучитьВидОперации(СтрокаТаб.Удалить_ВидСобытия, Справочники.ВидыОпераций.ВводВЭксплуатацию);
				
			ИначеЕсли (ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.ВводСведенийВНАМСФО"))
				И СтрокаТаб.ВидОперацииВыбытия.Пустая() Тогда
				
				СтрокаТаб.ВидОперацииВыбытия = ПолучитьВидОперации(СтрокаТаб.Удалить_СобытиеВыбытия, Справочники.ВидыОпераций.ВыбытиеВНА);
				
			ИначеЕсли (ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.ВыбытиеВНАМСФО"))
				И СтрокаТаб.ВидОперации.Пустая() Тогда
				
				СтрокаТаб.ВидОперации = ПолучитьВидОперации(СтрокаТаб.Удалить_ВидСобытияВНА, Справочники.ВидыОпераций.ВыбытиеВНА);
				
			КонецЕсли;
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
		
	КонецЦикла;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	т.Регистратор КАК Ссылка,
	|	ИСТИНА КАК РасчетныеДанныеВНА
	|ИЗ
	|	РегистрНакопления.РасчетныеДанныеВНА КАК т
	|ГДЕ
	|	т.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	т.Регистратор,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрНакопления.СтоимостьВНАМСФО КАК т
	|ГДЕ
	|	т.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ПустаяСсылка)");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.РасчетныеДанныеВНА Тогда
			нз = РегистрыНакопления.РасчетныеДанныеВНА.СоздатьНаборЗаписей();
		Иначе	
			нз = РегистрыНакопления.СтоимостьВНАМСФО.СоздатьНаборЗаписей();	
		КонецЕсли;
		
		нз.Отбор.Регистратор.Установить(Выборка.Ссылка);
		нз.Прочитать();
		
		Для каждого Запись Из нз Цикл
			Если Запись.ВидОперации.Пустая() Тогда
				Запись.ВидОперации = ПолучитьВидОперации(Запись.Удалить_ВидОперации, Справочники.ВидыОпераций.ПринятиеКУчетуВНА);
			КонецЕсли;		
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(нз);
			
	КонецЦикла; 
		
КонецПроцедуры

Функция ПолучитьВидОперации(ВидСобытия, ВидОперацииПоУмолчанию = Неопределено)

	Если ВидСобытия = ПредопределенноеЗначение("Перечисление.УдалитьВидыСобытийВНА.ВводВЭксплуатацию") 
		Или ВидСобытия = ПредопределенноеЗначение("Перечисление.УдалитьВидыСобытийВНА.ПринятиеКУчетуСВводомВЭксплуатацию") Тогда
		
		Возврат Справочники.ВидыОпераций.ВводВЭксплуатацию;
		
	ИначеЕсли ВидСобытия = ПредопределенноеЗначение("Перечисление.УдалитьВидыСобытийВНА.ПринятиеКУчету") Тогда
		
		Возврат Справочники.ВидыОпераций.ПринятиеКУчетуВНА;
		
	ИначеЕсли ВидСобытия = ПредопределенноеЗначение("Перечисление.УдалитьВидыСобытийВНА.Выбытие") Тогда 
		
		Возврат Справочники.ВидыОпераций.ВыбытиеВНА;
		
	ИначеЕсли ВидСобытия = ПредопределенноеЗначение("Перечисление.УдалитьВидыСобытийВНА.Передача")	
		Или ВидСобытия = ПредопределенноеЗначение("Перечисление.УдалитьВидыСобытийВНА.ПодготовкаКПередаче") Тогда 
		
		Возврат Справочники.ВидыОпераций.ПередачаВНА;
		
	ИначеЕсли ВидСобытия = ПредопределенноеЗначение("Перечисление.УдалитьВидыСобытийВНА.Списание")
		Или ВидСобытия = ПредопределенноеЗначение("Перечисление.УдалитьВидыСобытийВНА.ЧастичнаяЛиквидация") Тогда
		
		Возврат Справочники.ВидыОпераций.СписаниеВНА;
		
	ИначеЕсли ВидСобытия = ПредопределенноеЗначение("Перечисление.УдалитьВидыСобытийВНА.Дооборудование") 
		Или ВидСобытия = ПредопределенноеЗначение("Перечисление.УдалитьВидыСобытийВНА.Достройка") 
		Или ВидСобытия = ПредопределенноеЗначение("Перечисление.УдалитьВидыСобытийВНА.КапитальныйРемонт")
		Или ВидСобытия = ПредопределенноеЗначение("Перечисление.УдалитьВидыСобытийВНА.Модернизация")
		Или ВидСобытия = ПредопределенноеЗначение("Перечисление.УдалитьВидыСобытийВНА.Реконструкция")
		Или ВидСобытия = ПредопределенноеЗначение("Перечисление.УдалитьВидыСобытийВНА.СреднийРемонт")
		Или ВидСобытия = ПредопределенноеЗначение("Перечисление.УдалитьВидыСобытийВНА.ТекущийРемонт")
		Или ВидСобытия = ПредопределенноеЗначение("Перечисление.УдалитьВидыСобытийВНА.ТекущийРемонт")
		Тогда
		
		Возврат Справочники.ВидыОпераций.МодернизацияВНА;
		
	ИначеЕсли ВидСобытия = ПредопределенноеЗначение("Перечисление.УдалитьВидыСобытийВНА.ИзменениеПараметровАмортизации") Тогда
		
		Возврат Справочники.ВидыОпераций.ИзменениеПараметровАмортизации;
		
	ИначеЕсли ВидСобытия = ПредопределенноеЗначение("Перечисление.УдалитьВидыСобытийВНА.НачислениеАмортизации") Тогда
		
		Возврат Справочники.ВидыОпераций.НачислениеАмортизации;
	
	ИначеЕсли ВидСобытия = ПредопределенноеЗначение("Перечисление.УдалитьВидыСобытийВНА.НачальныеОстатки") Тогда
		
		Возврат Справочники.ВидыОпераций.НачальныеОстаткиВНА;
		
	ИначеЕсли ВидСобытия = ПредопределенноеЗначение("Перечисление.УдалитьВидыСобытийВНА.Обесценение") Тогда
		
		Возврат Справочники.ВидыОпераций.ОбесценениеВНА;
		
	ИначеЕсли ВидСобытия = ПредопределенноеЗначение("Перечисление.УдалитьВидыСобытийВНА.Переоценка") Тогда
		
		Возврат Справочники.ВидыОпераций.ПереоценкаВНА;
		
	Иначе 
		
		Возврат ВидОперацииПоУмолчанию;
		
	КонецЕсли;

КонецФункции

#КонецОбласти

#КонецЕсли
